#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-prod-sso-requests/runs/run-AH2AhsN17GcaPDQ8

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=7pXWFg]
random_password.db_password: Refreshing state... [id=none]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.s3_ocp.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-ocp]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kgodz1zmk2]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-keycloak-v2]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
module.s3_sysdig.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.actions: Refreshing state... [id=vw6kd8]
aws_api_gateway_resource.app: Refreshing state... [id=sniyra]
aws_api_gateway_resource.proxy: Refreshing state... [id=aqhevc]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cn65f5]
aws_security_group.rds_sg: Refreshing state... [id=sg-0cbc5116a7eb44966]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-006d5ccf7acdb99cc]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-kgodz1zmk2-aqhevc-ANY]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-kgodz1zmk2-cn65f5-ANY]
module.s3_ocp.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-ocp]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_ocp.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-ocp,private]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210903190658559400000001]
module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-prod-sysdig]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
module.s3_sysdig.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-sysdig,private]
module.s3_sysdig.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-keycloak-v2,private]
module.s3_sysdig.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=xgr00q-prod-keycloak-v2]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-keycloak-v2]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-keycloak-v2]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-3019186098]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-kgodz1zmk2-cn65f5-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-kgodz1zmk2-aqhevc-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=njfdb0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this has been changed
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
        id     = "xgr00q-prod-ocp"
        # (1 unchanged attribute hidden)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
      - rule {
          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }
  # module.s3_ocp.aws_s3_bucket.this has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "xgr00q-prod-ocp"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }


      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

        # (2 unchanged blocks hidden)
    }
  # module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this has been changed
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
        id     = "xgr00q-prod-sysdig"
        # (1 unchanged attribute hidden)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
      - rule {
          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }
  # module.s3_sysdig.aws_s3_bucket.this has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "xgr00q-prod-sysdig"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }


      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

        # (2 unchanged blocks hidden)
    }
  # module.s3_keycloak_v2.aws_s3_bucket.this has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "xgr00q-prod-keycloak-v2"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }


      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

        # (2 unchanged blocks hidden)
    }
  # module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this has been changed
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
        id     = "xgr00q-prod-keycloak-v2"
        # (1 unchanged attribute hidden)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
      - rule {
          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-05-20T21:15:24.396Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-05-20T21:15:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "yYFwierXpyOkus8Acow6P6ao3jQARcGbbgp46n4DPoE=" -> "JBP/G52pmdqb0rMdi/hM7V7EnFRNsJ5+wCBmyh6AV0o="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-05-20T21:15:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "j24GlbMB1MRgsbZnTQtRresIvV4cq0h0ys7J6LaT7CA=" -> "b5pcM97YIexHeE6J3nUeLGDt+mb5vA0AkFqKR7KNU2I="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-05-20T21:15:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "do84+i8IkzCSiJDgNVpyb6/ETDkZfmnmS82IRD0nusQ=" -> "jPtas617zXclXCVlD7mTmOFf9IEwvNNnF4lf1d/71hw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-05-20T21:15:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "hY0uNQW476NYcXgDsEhg0bqnhqlQXUHekEcrZXEPgMg=" -> "pe0cu1kVrrg1+f724PlHHcB3AbdrlegThvoEehmzdrM="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.s3_keycloak_v2.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::xgr00q-prod-keycloak-v2" -> (known after apply)
      ~ bucket                      = "xgr00q-prod-keycloak-v2" -> "xgr00q-prod-keycloak" # forces replacement
      ~ bucket_domain_name          = "xgr00q-prod-keycloak-v2.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "xgr00q-prod-keycloak-v2.s3.ca-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1QDHH18159H29" -> (known after apply)
      ~ id                          = "xgr00q-prod-keycloak-v2" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ca-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule {
          ~ allowed_headers = [
              - "*",
            ] -> (known after apply)
          ~ allowed_methods = [
              - "PUT",
            ] -> (known after apply)
          ~ allowed_origins = [
              - "*",
            ] -> (known after apply)
          ~ expose_headers  = [
              - "ETag",
            ] -> (known after apply)
          ~ max_age_seconds = 3000 -> (known after apply)
        }

      - grant {
          - id          = "d084d0ca949f1b982042f2aca23078aee1f7a8e1edf391542af542e663d5ed96" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_keycloak_v2.aws_s3_bucket_acl.this must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket = "xgr00q-prod-keycloak-v2" -> "xgr00q-prod-keycloak" # forces replacement
      ~ id     = "xgr00q-prod-keycloak-v2,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "d084d0ca949f1b982042f2aca23078aee1f7a8e1edf391542af542e663d5ed96" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          ~ owner {
              + display_name = (known after apply)
              ~ id           = "d084d0ca949f1b982042f2aca23078aee1f7a8e1edf391542af542e663d5ed96" -> (known after apply)
            }
        }
    }

  # module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "this" {
      ~ bucket = "xgr00q-prod-keycloak-v2" -> "xgr00q-prod-keycloak" # forces replacement
      ~ id     = "xgr00q-prod-keycloak-v2" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "xgr00q-prod-keycloak-v2" -> (known after apply) # forces replacement
      ~ id                      = "xgr00q-prod-keycloak-v2" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket = "xgr00q-prod-keycloak-v2" -> "xgr00q-prod-keycloak" # forces replacement
      ~ id     = "xgr00q-prod-keycloak-v2" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

Plan: 5 to add, 4 to change, 5 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-05-20T21:15:24.396Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 11 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*